defend_chose_dict = {
    "후퇴": """
최전방 스트라이커를 포함한 모든 필드 선수가 수비 지역으로 내려와서 포메이션 대형을 유지합니다.
수비 라인을 낮추는 것은 상대의 침투 플레이에 대응하기 더 쉽게 만들며, 페널티 박스 내에서도 밀집된 수비 라인을 구성함으로서 상대보다 수적 우위를 확보하여 패스 전개를 어렵게 합니다.
그렇지만 선수에게 압박하기보다 거리를 두고 수비하기 때문에 중거리 슛에 취약할 수 있습니다.
또한, 깊은 수비 라인으로 인해 공 소유를 가져오더라도 전방으로 이동하는 시간이 필요하여 빠른 역습을 펼치기는 어려운 점이 있습니다.
이 전술의 단점을 보완하려면 다른 전술을 응용해 볼 수 있습니다.
'오프사이드 트랩'으로 압박 거리를 줄일 수 있고, '빠른 빌드업'은 전방 이동 시간을 단축할 수 있는 공격 전술로 효과를 볼 수 있습니다.
이와 같이 경기 상황에 맞는 전략적인 선택이 필요합니다.

# 상대 침투 플레이에 대한 대응
· 수비 라인을 내려서 유지하면 GK와 수비 라인 사이의 거리가 짧아지면서 뒷 공간이 좁아지게 됩니다.
· 수비 뒷 공간이 제한되어 있으면 수비 뒤를 노리는 침투 플레이를 효과적으로 방어할 수 있습니다.
· 만약 상대가 스피드가 빠른 공격수로 침투 플레이를 활용하려 한다면 이를 대응할 수 있는 전술로 사용할 수 있습니다.

# 수비 상황에서의 수적 우위
· 후퇴 전술은 수비 라인을 내려서 대형을 만들기 때문에 수비 상황에서 수적 우위를 점할 수 있습니다.
· 이로 인해 상대의 전진 패스를 효율적으로 대응할 수 있고, 페널티 박스 내에 많은 선수들이 배치되어 있어서 패스 전개를 방해합니다.
· 상대가 컷백 혹은 페널티 박스 내 짧은 패스 플레이에 강점이 있다면 후퇴 전술로 대응해보는 것도 좋은 방안이 될 수 있습니다.

# 상대의 중거리 슛에 취약
· 상대가 중거리 슛 플레이에 강점이 있다면, 후퇴 전술은 적합하지 않을 수 있습니다.
· 수비적인 위치를 유지하면 집중적으로 상대에게 압박을 가하기가 어렵습니다.
· 물론, 밀집된 수비 형태는 유지하겠지만 슈팅 거리를 좁히지 못하면 중거리 슛 기회를 허용할 수 있습니다.
· 또한, 상대 선수와의 거리를 두고 수비하기 때문에 페널티 박스 바깥쪽 지역에서 패스 전개를 대응하기 까다로운 점도 있습니다.
· 하지만 빠른 수비 전술인 '오프사이드 트랩' 또는 '팀 압박'을 활용하여 수비 라인을 올리면서 압박할 수 거리를 좁힌다면 후퇴 전술이 가지고 있는 단점을 보완할 수 있습니다.
""",
    "밸런스": """
가장 기본적인 수비 포메이션 형태를 유지합니다.
선수는 수비와 공격 사이에서 자연스럽게 전환하며, 너무 수비적이거나 공격적이지 않게 합니다.
이처럼 '밸런스'는 상황에 따라 선수들은 필요한 위치로 이동하며, 빈틈이 생겼을 때는 즉시 수비 위치로 돌아갑니다.

# 공격적인 전술을 원하는 경우
· 수비 상황에서 선수들은 본래의 위치에서 크게 벗어나지 않으며, 상황에 따라 간격을 유지한 상태에서 이동합니다.
· 이러한 특성으로 인해 다른 전술들 보다 선수의 스태미너에 부담을 덜 주기 때문에 '빠른 빌드업'과 같은 공격적인 전술을 사용할 때 잘 어울릴 수 있습니다.
· 이 경우 뛰어난 공격력과 기본 균형을 유지한 수비력이 동시에 발휘되어 전반적으로 균형잡힌 플레이를 할 수 있습니다.

# 기본 수비 형태를 유지하는 경우
· '밸런스'전술은 공격과 수비 사이의 균형을 잡는 데에 효과적일 수 있지만 전술적으로는 명확한 강점을 제공하지 않아 전술적인 면에서 다소 부족한 느낌을 줄 수 있습니다.
· 하지만 다른 압박 전술의 경우 적극적인 수비로 상대로부터 공을 빼앗는데 유리할 수 있지만. 실패했을 때는 오히려 상대에게 빈 공간을 내주게 됩니다.
· 이에 반해 '밸런스' 전술은 기본적인 수비 균형을 유지하면서 상대의 공격을 효과적으로 방어하고, 동시에 리스크를 최소화하는 장점이 있습니다.
· 이는 다양한 상대 공격에 유연하게 대응할 수 있으며, 포메이션이 흐트러지거나 빈공간을 내주는 것을 방지하여 공격으로의 전환 시에도 자연스럽게 이어나갈 수 있습니다.
""",
    "볼 터치 실수 시 압박": """
일반적으로 밸런스 전술과 비슷한 대형을 유지하되 상대가 불안정하게 빌드업을 할 경우, 공을 소유한 상대 선수의 주변을 압박하면서 패스 경로를 차단하려 합니다.
압박 효과는 다음의 세 가지 상황에서 발동됩니다.
① 상대가 공격 방향을 등지고 있는 상황
② 상대 수비 지역에서 사이드 라인으로 빌드업을 시도할 때, 주변에 아군 선수가 위치한 상황
② 루즈볼이 발생한 상황
위와 같이 '볼 터치 실수 시 압박' 전술은 압박이 필요한 상황에서만 효과가 발동되므로, 압박에 따른 위험을 최소화하는 데 도움이 됩니다.
따라서, 지속적인 압박을 원하지 않는 경우에 효과를 볼 수 있습니다.
※ 압박 효과가 발동되면 선수는 일반적인 경우보다 더 많은 스태미너를 소모하게 됩니다.

# 상대가 공격 방향을 등지고 있는 상황에서의 압박
· 공격 방향을 등지고 있는 상황이 되면 상대가 원활한 빌드업 플레이를 할 수 없다고 판단하여 약 5초 동안 4~5명의 선수가 주변 선수들을 압박하여 패스 경로 차단을 시도합니다.
· 이러한 압박은 가로채기 기회를 만들거나 뒤로 패스하도록 유도하여 수비를 재정비하기에도 좋습니다.

# 사이드 라인 빌드업 시 압박
· 상대가 수비 지역에서 사이드 라인으로 빌드업을 시도할 때 압박이 효과적일 것으로 판단되면, 약 5초 동안 4~5명의 선수들이 주변의 상대 선수를 압박하게 됩니다.
· 사이드 지역은 패스 선택의 범위가 제한되므로, 이 시점에서의 압박은 상대 빌드업을 방해하는데 효과적입니다.
· 이 압박은 상대가 하프라인을 넘어 공격 지역으로 진입하면 발동되지 않습니다.
· 이는 공격 지역에서의 지나친 압박이 수비 라인을 무너지게 하여 상대에게 공간을 내어줄수도 있기 때문입니다.

# 루즈볼 상황에서 압박
· 루즈볼 상황이란 선수들 간의 충돌 등으로 인해 예측하기 어렵게 공이 튀는 상황을 뜻합니다.
· 이때 공 소유권을 가져오기 위해 약 5초 동안 압박을 가하게 됩니다.
· 만약 공 소유권을 가져오지 못하더라도 공 주변으로 수비에 가담할 수 있는 선수가 많아서 상대의 빌드업에 부담을 줄 수 있습니다.""",
    "공 뺏긴 직후 압박": """"
공격 플레이 중 공을 상대에게 내주자마자 선수들이 약 7초 동안 상대 주변 선수들을 압박하여 가능한 빨리 소유권을 되찾는 것을 중점으로 하는 전술입니다.
이는 실제 축구에서 '게겐 프레싱'으로 불리고 있으며, 상대에게 공 소유권을 내준 직후 압박을 가해 상대의 실수를 유발시킵니다.
이처럼 즉시 압박하는 것은 빠르게 공 소유를 가져올 수 있고, 공격적인 위치에서 공을 소유하여 득점 기회를 높이는 데에 매우 유용합니다.
다른 압박 전술과 마찬가지로 상대의 빌드업에 영향을 주지 못하면 수비 공백이 생길 수 있어서 다시 수비 대형을 갖추기에 어려움이 있을 수 있습니다.
※ 압박 효과가 발동되면 선수는 일반적인 경우보다 더 많은 스태미너를 소모하게 됩니다.

# 게겐 프레싱 효과
· '공 뺏긴 직후 압박' 전술은 공을 잃은 직후 상대에게 압박을 가해 재빠르게 다시 공격권을 되찾는 전술 입니다.
· 또한, 공을 뺏긴 직후 상대 역습에 취약할 수 있는데 이 전술은 공을 뺏긴 지역에서 바로 압박을 가하면서 상대 역습을 미리 차단할 수 있는 효과도 있습니다.

# 공격적인 위치에서 다시 득점 기회를 획득 가능
· 공 소유를 잃은 지역에서 즉시 압박을 가하여 공 탈취에 성공할 경우 공격적인 위치에서 플레이를 재개할 수 있게 됩니다.
· 이 경우 상대가 수비 전환을 다시 해야 하기 때문에 순간적으로 수비 라인에 빈 공간이 노출될 수 있습니다.
· 이러한 틈새를 적절히 활용하면 득점 기회를 창출하는 데 있어서 효과적인 전략이 될 수 있습니다.

# 압박 실패에 대한 대처
· 만약 상대가 긴 패스를 활용하면서 탈압박을 하는 경우, 상대에게 수비의 빈 공간을 내줄 수 있는 위험이 존재합니다..
· 이러한 상황에서는 사이드 풀백과 중앙 미드필더에게 '공격 시 후방 대기' 개인 전술 사용과 공격 참여도를 낮게 조정하여 상대 역습을 대비할 수 있습니다.
· 해당 개인 전술이 적용된 선수는 수비 지역에 머무려는 성향이 강해지기 때문에 바로 수비에 대응할 수 있어서 다른 선수들이 수비 지역으로 복귀하는 시간을 확보할 수 있습니다.
""",
    "지속적인 압박": """
수비 플레이 시 항상 압박을 가하며 상대 빌드업 플레이를 불안하게 만들고 그로 인해 공 소유를 되찾을 수 있는 전술입니다.
공격수 또한 압박에 관여하기 때문에 상대의 위험 지역에서 공 소유를 가져올 수 있어 득점 기회를 창출하는 시작점이 될 수 있습니다.
하지만 '지속적인 압박' 전술은 잦은 압박으로 인해 선수 스태미너 소모에 큰 영향을 주는 단점이 있습니다.
이는 이 전술을 오래 적용할 수록 스태미너 감소로 인해 선수들의 전반 플레이의 효율성이 저하될 수 있습니다.
이러한 단점은 특정 상황에서만 '지속적인 압박'을 사용하는 것으로 완화시킬 수 있습니다.
현재 경기에 지고 있는 상황이라서 전방부터 항상 압박하기 원하는 경우, 상대가 패스 전개에 강점을 보여 강한 압박하기 원하는 경우 등, 경기 상황에 따라 이 전술을 활용해야 합니다.
※ 압박 효과가 발동되면 선수는 일반적인 경우보다 더 많은 스태미너를 소모하게 됩니다.

# 지속적인 압박을 통한 공격 전략
· 전방에서 지속적으로 압박을 가하면 득점 기회를 창출할 수 있는 지역에서 공 소유를 가져올 수 있습니다.
· 이 경우, 몇 번의 패스 연결로 슈팅까지 시도할 수 있기 때문에 효과적인 압박 상황을 연출할 수 있습니다.
· 공격 전술에 '빠른 빌드업'전술을 적용한다면 공격으로 전환 시 빠른 공격 전개로 상대 수비를 공략하는 것도 효과적일 수 있습니다.
· 다만, 두 전술 모두 스태미너 감소에 큰 부분을 차지하기 때문에, 짧은 시간 안에 득점이 필요한 상황에 사용하는 것이 좋습니다.

# 상대 역습 및 패스 전개에 대처
· '지속적인 압박'은 매우 공격적인 수비 전술이지만 모든 상황에 적합한 것은 아닙니다.
· 상대가 압박을 풀어 나오면 압박에 따른 수비 형태가 무너져서 되려 상대에게 공격 기회를 제공하게 될 수 있습니다.
· 특히, 전체 수비 라인을 공격적으로 유지하면, 뒷 공간이 넓어지고 이로 인해 상대의 침투 플레이에 취약해지게 됩니다.
· 이처럼 상대가 역습 및 패스 전개에 능숙하다면 다른 수비 전술로 변화를 주는 것이 오히려 더 효과적일 수 있습니다.
· 일반적인 상황에서는 기본 균형 있는 수비를 유지하면서, 필요한 상황에서 압박하는 '볼 터치 실수 시 압박' 전술을 활용하면 좋습니다.
· 또한, 필요에 따라 즉시 강한 압박을 가해야 하는 상황에서는 빠른 공격 전술인 '팀 압박' 전술을 활용하여 일시적으로 강한 압박을 가하고 상대로부터 공 소유를 되찾을 수 있습니다.
· 이와 같이 상대 플레이 스타일에 따라 수비 전술을 선택하는 것이 경기 우위를 확보하는 데 도움을 줍니다.
""",
}

offend_chose_dict = {
    "느린 빌드업": """
공격 중심의 점유형 플레이를 하기 위한 공격 전술입니다.
공격 상황에서 전방으로의 포지셔닝보다는, 공을 소유한 선수를 중심으로 접근해서 패스를 받으려는 움직임을 주로 보입니다.
빠른 공격 플레이는 상대 수비 라인을 무너트리는 데에 효과가 있을 수 있지만 그로 인한 패스 미스 횟수가 늘어날 수 있기도 합니다.
'느린 빌드업'은 짧은 패스를 주고 받는 것을 기반으로 하여 안정적인 공격 플레이를 원하는 경우 이상적인 전략이 될 수 있습니다.
상대에게 공 소유권을 내주는 리스크를 최소화하려면 공격 플레이의 안정성을 높이면서도 공을 내줬을 때 상대 역습에 당할 확률을 낮춰주므로 효과적인 공격 전략이 될 수 있습니다.

# 높은 공 점유율을 유지할 수 있는 효과
· '느린 빌드업' 전술은 공을 소유한 선수를 중심으로 서포트 해주는 움직임을 보이기 때문에 다른 공격 전술에 비해 패스 옵션이 많게 됩니다.
· 이로 인해 짧은 패스 플레이에 용이하며 공 점유하고 있는 시간을 오래 가질 수 있게 되면서 상대 팀의 공격 기회를 적게 만들 수 있습니다.
· 높은 공 점유율을 기반으로 공격 플레이를 천천히 전개하여 공략하고 싶다면 '느린 빌드업'의 전술은 좋은 선택지가 될 수 있습니다.

# 짧은 패스 플레이를 이용한 공격 루트
· 짧은 거리에서 패스 플레이를 시도하면 상대는 압박하기 위해 패스 지역을 중심으로 몰리게 됩니다.
· 이때 상대는 한 곳으로 몰려 있기 때문에 반대 측면에는 공간이 노출될 수 있어서 전환 플레이를 통해 공격 찬스를 만들 수 있습니다.
· 패스 플레이를 활용하여 상대를 공에 집중시키고, 이를 통해 추가적인 공간 창출하는 플레이를 하면 득점 기회를 만드는 데 효과적일 것입니다.

# 상대 수비를 공략하기 힘든 경우
· 포워드 포지션을 제외한 미드 필더는 최소한으로 공격에 참여하기 때문에 상대 수비에 수적 우위를 가져가지 못하게 됩니다.
· 상대 수비수가 포메이션 대형을 유지하고 있는 상태일 때는 적은 인원으로 상대 수비를 공략하기엔 어려워 득점 기회를 만들기 어려울 수 있습니다.
· 이 경우에는 다이내믹 택틱스 기능을 사용하여 공격 전술의 변화를 가져가는 것도 좋은 방법이# 될 수 있습니다.
· 상대 수비를 공략하기 힘들 경우 '빠른 빌드업' 전술을 사용하면 짧은 시간 내에 공격적으로 위치하면서 이를 공격 루트로 활용할 수 있습니다.
· 그렇지만 공 소유를 잃게 되면 상대 역습에 대응하기 힘들 수 있어서 '빠른 빌드업' 전략이 부담 된다면 '밸런스'를 사용하여 기본적인 공격 형태로 변화 주는 것도 방법입니다.
""",
    "밸런스": """
밸런스는 공격적이면서도 수비적인 요소를 모두 유지하려는 균형 잡힌 전술 스타일입니다.
이 전술은 공격적이거나 수비적인 움직임이 강하게 작용되는 경우가 없어서, 상대 전술에 유연하게 대응할 수 있습니다.
특정 플레이에 특화되어 있지 않고 선수들은 공격 시 상황에 따라 필요한 위치로 이동하기 때문에 본인이 원하는 스타일을 만들기 쉬운 전술입니다.

# 안정적인 공격 플레이
· '밸런스' 전술은 공격과 수비 사이의 균형을 맞추려는 움직임을 보입니다.
· 이는 선수들이 너무 공격적으로 멀리 나가지 않도록 하여 공 소유를 잃었을 때 상대 역습에 취약한 부분을 방지할 수 있습니다.
· 안정적으로 공격 플레이를 하면서 동시에 수비적인 부분도 고려하고 싶다면 '밸런스'로 효과를 볼 수 있습니다.

# 다양한 공격 루트 활용
· '밸런스' 전술은 전술적인 특성이 없고 기본 움직임을 기반으로 공격을 전개하므로 다른 공격 전술 처럼 강점이 부각되지 않을 수 있습니다.
· 하지만 선수들이 균형 잡힌 움직임을 유지하면서 오히려 다양한 공격 루트로 자유롭게 전개할 수 있다는 장점도 있습니다.
· '밸런스' 전술로 다양한 공격 경로를 활용하여 상대 수비의 약점을 파악한 후, 다른 공격 전술로 변경해 상대 수비를 혼란스럽게 하는 전략도 가능합니다.
""",
    "긴 패스": """
'긴 패스'는 주로 상대 수비 라인의 뒷 공간을 최대한 활용하는 전술입니다.
그렇기 때문에 최전방에 있는 선수에게 위협적인 패스를 할 수 있는 상황이 자주 나타납니다.
특히, 상대 수비 라인이 높은 위치에 있거나, 상대가 공격적으로 플레이하는 경우 상대 수비 라인 뒷 공간이 충분히 확보된 상태일 가능성이 높기 때문에 더욱 효과적일 수 있습니다.
짧은 패스 플레이보다 상대 수비 라인에 깊게 침투하려는 선수에게 긴 패스를 하는 플레이를 원한다면 '긴 패스' 전술이 가장 적합합니다.

# 상대 수비 라인의 위치가 높은 경우
· 상대가 수비 라인을 높게 유지하는 경우 '긴 패스'전술이 효과적일 수 있습니다.
· 공격이 시작되면, 전방에 배치된 공격수들은 상대의 수비 라인 뒤, 즉 오프사이드 라인 근처로 이동하여 뒷공간 침투를 시도합니다.
· 이 상황에서 스루 패스나 로빙 스루 패스를 활용하여 위협적인 득점 기회를 만들 수 있습니다.
· 이 전술을 최대한 효과적으로 활용하려면, 전방에 속도가 빠른 선수를 배치하여 기습적으로 뒷공간에 패스를 연결하는 것이 중요합니다.

# 빠른 공격 전환과 카운터에 유리
· 상대가 공격적인 전술이라면 많은 선수들이 전방에 배치되기 때문에 공 소유권을 가져오는 순간, 근처에는 상대 선수가 밀집해 있을 가능성이 높습니다.
· 이때 '긴 패스' 전술을 사용하는 경우 미드필더를 거치지 않고 바로 최전방의 선수에게 공을 연결할 수 있기 때문에 더욱 효과적일 수 있습니다.

# 상대가 수비 라인을 내리는 경우
· '긴 패스'전술의 주요 목표는 전방 공격수가 상대의 수비 라인 뒷 공간을 활용하여 득점 기회를 창출하는 것입니다.
· 그러나 상대가 수비 라인을 내려서 수비하면 뒷 공간이 제한되어 '긴 패스'전술 효과를 발휘하기 어려울 수 있습니다.
· 또한 패스가 성공하더라도 상대가 이미 수비적인 위치를 확보하고 있어, 득점 기회를 만드는 데 어려움이 생깁니다.
· 이러한 상황이 지속되면 공격 전술을 변경하는 것이 더 효과적일 수 있습니다.

# 공중볼 경합에 밀리는 경우
· '긴 패스'전술을 통한 공격은 대체로 짧은 패스보다 거리가 먼 선수를 목표로 패스하는 경우가 많습니다.
· 때문에, 로빙 패스를 주로 사용하게 되어, 상대와의 공중볼 경합이 빈번하게 발생합니다.
· 이러한 공격 패턴이 반복될 경우 상대에게 쉽게 예측되어 공격 기회 창출에 어려움이 있을 수 있습니다.
· 또한 짧은 패스보다 긴 패스는 정확성이 낮기 때문에 공 소유를 쉽게 내줄 가능성이 있습니다.
· 이런 경우에는 수비와 미드필더 라인에서 빌드업을 하며 공격 루트를 창출하는 방식으로 플레이에 변화를 주는 것이 중요합니다.
""",
    "빠른 빌드업": """
'빠른 빌드업'은 공격의 템포와 그에 따른 효과를 극대화하는 목적으로 사용되는 전술입니다.
수비 포지션을 제외한 선수들이 적극적으로 전방으로 이동하면서 상대 수비수보다 수적 우위를 점하여 공격 찬스를 만들 수 있습니다.
하지만 선수들의 적극적인 움직임으로 인해 스태미너 소모량이 클 수 있기 때문에 경기 상황에 따라 신중하게 사용해야 합니다.

# 빠른 공격 플레이의 주요 효과
· 공격 플레이 시 선수들이 빠르게 전방으로 이동하기 때문에 상대 수비의 빈틈을 적극적으로 활용할 수 있습니다.
· 또한 상대가 본인의 깊은 수비 지역에서 공 소유를 잃게 된다면 빠른 역습으로 짧은 시간에 득점 기회를 창출할 수 있습니다.

# 공격 지역에서 수적 우위 효과
· 빠른 빌드업은 CB 선수를 제외한 선수들이 공격적으로 움직이기 때문에 상대보다 수적 우위를 확보할 수 있습니다.
· 또한 많은 선수들의 공격에 참여로 인하여 상대 수비 시선을 분산시키고 더 좋은 위치에 있는 선수에게 패스하는 등, 다양한 공격 옵션을 만들어낼 수 있습니다.

# 수비적 취약성에 대한 대처
· 공격 플레이 시 선수들이 빠르게 전방으로 이동하다 보니, 공을 잃었을 때 역습에 대응하기 어려워집니다.
· 특히 공격 지역에서의 지공 상황이 오래 지속되면 미드필더 선수들까지 전방에 가까운 위치까지 올라가게 되어, 공을 잃었을 때 상대 역습에 대응할 선수가 부족해지는 위험이 있습니다.
· 이러한 상황을 예방하기 위해 사이드 풀백 혹은 중앙 미드필더에게 특정 개인 전술을 설정하는 것도 방법이 될 수 있습니다.
· 중앙 미드필더의 경우 '공격 시 후방 대기', '수비수 사이에 위치'를 사용하면 전방으로 올라가지 않고 후방 지역에 위치하려고 노력합니다.
· 사이드 풀백 또한 '공격 시 후방 대기'와 더불어 공격 참여도를 낮은 수치로 설정하여 상대 역습에 대한 리스크를 최소화할 수 있습니다.

# 스태미너 소모에 대한 대처
· 수비 선수를 제외한 모든 선수가 적극적으로 움직이기 때문에 스태미너를 많이 소모하게 되고, 경기 후반에는 효과가 떨어지게 될 수 있습니다.
· 이 경우에는 미드필더나 공격수 포지션의 선수 교체를 통해 리스크를 완화하는 것이 좋습니다.
· 교체된 선수는 '빠른 빌드업'을 적용하더라도 스태미너가 많기 때문에, 게임 체인저로 활용하여 공격 기회를 만들 수 있습니다.

""",
}
defend_score_dict = {
    "폭": """
수비 상황에서 수비 라인의 넓이를 조절할 수 있습니다.
이는 수비 선수들이 좁게 혹은 넓게 수비 라인을 형성하는 지를 결정하게 됩니다.
이전에도 조정할 수 있는 기능이었지만,뉴택틱 업데이트 이후 부터는 최소, 최대 범위가 좀 더 넓어졌고 수치에 따른 변별력이 커집니다.
상대가 크로스 위주의 플레이를 한다면 폭을 넓게 설정하여 측면 수비를 강화할 수 있고, 상대가 중앙 지역을 공략한다면 수비 폭을 좁게 하여 대응할 수 있습니다.
이와 같이 상대의 전술 상황을 고려하여 적절한 수비 간격을 설정하는 것이 중요합니다.


# 중앙 지역으로 좁게 유지 ( 추천 수치 : 1~3 )
· 수비 폭을 좁게 배치하여 중앙 지역을 강화하여 수비 간격을 형성하게 됩니다.
· 수비 간격을 좁게 형성하면 중앙 지역에 패스를 들어오지 못하게 하면서 침투 패스 공간을 내주지 않게 하여 위험 지역에서 슈팅 기회를 차단하는 데에 효과적입니다.
· 하지만, 중앙이 두터워진 만큼 필연적으로 측면의 공간은 많을 수 밖에 없어 상대의 크로스와 컷백 플레이를 활용한 공격 전개에 위험할 수 있습니다.
· 이러한 상황에 대비하기 위해서는 제공권이 좋은 중앙 수비를 배치하는 것이 좋습니다.
· 상대가 측면을 활용한 공격 전개를 하더라도 결과적으로 페널티 박스 안으로 들어오기 때문에 제공권이 좋은 중앙 수비를 배치하면 경합에 승리할 확률을 높여주면서 원활하게 슈팅 기회를 내주지 않을 수 있습니다.

# 적절한 수비 간격 유지 ( 추천 수치 : 4~7 )
· 수비 폭을 균형 잡힌 수준으로 배치하여 전반적으로 적절한 수준의 수비 간격을 유지합니다.
· 이는 상대가 중앙과 측면 공격을 혼합하여 사용하는 경우에 특히 유용할 수 있습니다.
· 적절한 수비 간격을 유지하는 것은 다양한 공격 상황에 효과적으로 대응할 수 있는 선택지를 제공합니다.

# 측면으로 넓게 유지 ( 추천 수치 : 8~10 )
· 수비 폭을 넓게 배치하여 최대한 경기장을 활용한 수비 간격으로 형성합니다.
· 수비 간격을 넓게 유지하면 풀백이 사이드 라인 근처로 위치하기 때문에 상대의 크로스 및 컷백 플레이에 대응할 수 있습니다.
· 이처럼 측면 수비를 강화할 수 있는 장점이 있는 반면, 중앙 지역에는 넓은 간격으로 인해 침투할 수 있는 공간이 생기게 됩니다.
· 그러므로, 넓은 수비 간격을 유지하는 동안에는 상대 공격수가 중앙으로 침투하는 상황에 대한 대비도 신경 써야 합니다.
""",
    "깊이": """
수비 상황에서 수비 라인의 깊이를 조절할 수 있습니다.
이 설정에 따라 수비 라인을 얼마나 깊게 배치되는지 혹은 높게 수비 라인을 형성하는 지를 결정합니다.
깊이 수치의 효용 가치를 높이기 위해서는 수비 전술을 응용하는 것이 좋습니다.
전방으로부터 압박하기를 원한다면 깊이의 수치를 높이고 수비 전술 내 '지속적인 압박', '공 뺏긴 직후 압박' 등과 같은 압박 전술을 활용하여 더 효과적으로 압박할 수 있습니다.
안정적인 수비 대형을 유지하기 원한다면 깊이의 수치를 낮추고 수비 전술 내 '후퇴', '밸런스' 전술을 활용하면 지역 수비로 형성하기 때문에 더 효과적으로 작용하게 됩니다.

# 깊은 수비 라인 ( 추천 수치 : 1~3 )
· 수비 라인을 자신의 진영에 가깝게 배치합니다.
· 상대에게 뒷 공간을 최소한으로 내주면서 빠르게 진행되는 공격을 효과적으로 수비할 수 있게 합니다.
· 그러나, 수비 라인이 전반적으로 뒤로 내려가 있어 상대 선수를 대인 마크하기에는 어려워서 압박이 어려운 단점이 있습니다.
· 이로 인해 공을 소유한 상대 선수에게 더 많은 공간이 주어지게 되며, 중거리 슛 기회를 허용하거나 패스 플레이에 취약할 수 있습니다.

# 보통 ( 추천 수치 : 4~7 )
· 수비 라인을 어느 정도 균형 잡힌 수준으로 라인을 형성하게 됩니다.
· 이 경우 적절한 거리에서 상대를 압박하면서도 뒷 공간에 대한 수비도 동시에 할 수 있게 됩니다.
· 만약, 상대가 뒷 공간을 노리는 플레이와 패스 플레이 등 다양한 공격 패턴을 응용한다면 이를 유연하게 대응할 수 있습니다.

# 높은 수비 라인 ( 추천 수치 : 8~10 )
· 수비 라인을 상대 진영에 가깝게 배치합니다.
· 수비 라인을 높게 유지하면 압박할 수 있는 범위가 좁아져 상대의 공격에 효율적으로 대응할 수 있습니다.
· 특히, 상대가 짧은 패스를 주로 활용 한다면 높은 수비 라인으로 상대의 빌드업 플레이를 어렵게 만들 수 있습니다.
· 이 수치의 단점은 수비 라인 뒷 공간이 넓어져 상대의 침투 플레이에 취약성이 있습니다.
· 상대가 긴 패스를 활용해 수비 라인 뒷 공간을 공략한다면 높은 수비 라인 설정은 적절하지 않을 수 있기 때문에 상대 공격 패턴에 따라 변화를 주는 것이 좋은 방법입니다.
""",
}

offend_score_dict = {
    "폭": """
공격 상황에서 선수의 폭을 얼마나 넓게 유지할지를 결정하는 설정입니다.
공격 - 폭의 경우 1부터 10까지 조정 가능할 수 있으며, 높은 수치일수록 공격 시 선수의 폭을 넓게 유지하면서 경기장을 넓게 사용하려고 합니다.
폭 수치의 효용 가치를 올리기 위해서는 상대의 수비 간격을 주목해야 합니다.
상대가 수비 간격을 좁게 형성하고 있으면 측면에 공간이 많기 때문에 폭을 넓게하여 사이드 플레이로 상대를 공략할 수 있습니다.
반대로 상대가 수비 간격을 넓게 형성하고 있다면 간격 사이의 틈을 활용한 침투 플레이가 용이할 수 있습니다.

# 짧은 패스 플레이 ( 추천 수치 : 1~3 )
· 선수 간의 폭을 좁게 가져가면서 주로 경기장 중앙을 통해 공격이 이루어집니다.
· 때문에, 측면을 이용한 공격보다는 중앙에서의 패스 플레이를 통해 공격 루트를 만들어나가는 것이 가장 큰 특징입니다.
· 선수의 간격이 좁아서 짧은 패스 플레이를 하기가 용이하지만 상대도 중앙 쪽으로 좁게 대형을 유지하고 있으면 쉽게 압박을 당할 수 있고 공 소유를 잃었을 때 측면 수비가 약해질 수 있는 상황이 발생합니다.

# 간격 균형 유지 ( 추천 수치 : 4~7 )
· 공격적인 플레이와 수비적인 플레이 사이의 균형을 찾는 팀에 적합하며, 경기장 전체를 적절히 사용하면서 공격을 풀어나갑니다.
· 이는 중앙과 측면 공격 모두 활용할 수 있기 때문에 공격 시 밸런스가 잡힌 상태로 선수 간격을 유지하고 싶다면 4~7 정도가 적절합니다.

# 넓은 공간 활용 ( 추천 수치 8~10 )
· 측면 공간을 활용한 공격 플레이가 가능하도록 경기장에 최대한 넓게 위치합니다.
· 이 설정의 경우 중앙에서 패스 플레이를 하기 보다는 사이드 윙어를 이용한 측면 플레이가 효과적입니다.
· 다만 간격을 벌린 만큼 중앙에는 빈 공간을 내줄 수 있어서 상대가 역습을 통한 침투 패스에 취약할 수 있습니다.
""",
    "박스 안 쪽 선수": """
크로스 상황에서 얼마나 많은 선수가 상대 페널티 박스 안에 진입하게 될지를 결정합니다.
해당 전술의 설정은 1부터 10까지 조정 가능하며, 설정한 수치에 따라 크로스를 활용한 다양한 플레이가 가능합니다.

# 수비적인 크로스 플레이 ( 추천 수치 :1~3 )
· 수비적인 플레이 스타일에 적합한 수치입니다.
· 이 수치는 페널티 박스 내에 배치된 선수의 수가 적기 때문에 크로스 플레이에는 적합하지 않을 수 있습니다.
· 이 경우, 대부분의 선수가 페널티 박스 바깥 근처에 위치해 있기 때문에 패스 전개로 중거리 슛 기회를 만드는것이 더 효과적일 수 있습니다.
· 또한 선수들이 박스 안에 집중되어 있지 않으므로 공을 상대에게 내주더라도 역습에 빠르게 대응하는데 효과적입니다.

# 균형적인 크로스 플레이 ( 추천 수치 : 4~7 )
· 공격과 수비 사이에서 균형을 유지하는 플레이 스타일에 적합한 수치입니다.
· 페널티 박스 안에 적절한 수의 선수가 위치해 있어, 크로스를 활용한 공격적인 플레이를 진행하면서도 상대의 공격에 대비할 수 있습니다.

# 공격적인 크로스 플레이 ( 추천 수치 8~10 )
· 크로스를 활용한 득점을 만드는 플레이에 강점이 있다면, 해당 수치가 적합할 수 있습니다.
· 크로스 능력치가 뛰어난 선수와 공중볼 경합에 우위가 보장될 수 있는 선수가 있다면 이 설정은 더 유용해질 수 있습니다.
· 이는 크로스 상황에서 페널티 박스 내에 많은 선수가 침투하여 헤더나 세컨볼을 차지하는 것에 유리하게 작용합니다.
· 하지만 수비 전환 시에는 많은 선수가 상대 페널티 박스 안에 머물러 있게 되어 역습에 취약해질 수 있습니다.
""",
    "코너킥": """
코너킥은 전략에 따라 득점 찬스를 쉽게 얻을 수도 있는 중요한 세트플레이입니다.
코너킥 수치를 통해 페널티 박스 안에 선수를 얼마나 배치시킬지 결정하고 다양한 패턴으로 플레이할 수 있습니다.

# 수비적인 코너킥 ( 추천 수치 : 1~2 )
· 코너킥 시 공격자가 상대 페널티 박스 안에 적게 배치됩니다.
· 이는 페널티 박스 안에서 헤딩이나 슈팅을 시도하는 기회가 줄어들 수 있지만 페널티 박스 바깥 쪽에는 많은 선수들이 배치되어 있어서 상대 역습 대비에 효과적입니다.
· 경기 상황에 따라 무리하게 공격을 할 상황이 아니거나 공중볼에 강점이 없는 경우 코너킥 인원을 적게 배치하는 것이 좋은 방법이 될 수 있습니다.

# 균형 잡힌 코너킥 ( 추천 수치 : 3 )
· 코너킥 시 상대 페널티 박스 안에 선수가 적당히 배치됩니다.
· 공격과 수비 간의 균형을 유지하는데 적합하며, 코너킥으로 득점 기회를 만드는 것과 상대 역습을 대비하는 효과 사이의 적절한 선택지입니다.

# 공격적인 코너킥 ( 추천 수치 : 4~5 )
· 코너킥 시 상대 페널티 박스 안에 많은 선수가 배치됩니다.
· 특히 공중볼 경합에 능한 선수가 많다면 페널티 박스 안에 선수를 많이 배치해 득점 기회를 더욱 늘릴 수 있습니다.
· 이는 경기의 마지막 순간에 코너킥을 통해 득점을 시도하는 상황에서도 유용할 수 있습니다.
· 하지만, 상대와의 경합에서 패배하면 상대 역습에 대응하는 선수가 부족해질 수 있으므로 이 점을 고려해야 합니다.
""",
    "프리킥": """
프리킥은 축구에서 중요한 전략적 요소로 활용할 수 있습니다.
직접 프리킥으로 득점을 노릴 수도 있고 페널티 박스 안 동료 선수에게 연결해서 헤딩 혹은 슈팅 기회도 얻을 수 있습니다.
다만, 이전 프리킥 상황에서는 페널티 박스 안 동료 선수의 수가 제한적이어서 다양한 프리킥 루트를 활용하기 어려웠습니다.
이제는 프리킥 수치 설정을 통해 상대 페널티 박스 내 선수의 수를 조정하여 다양한 세트피스 기회를 만들 수 있습니다.

# 수비적인 프리킥 ( 추천 수치 : 1~2 )
· 프리킥 시 공격자가 상대 페널티 박스 안에 적게 배치됩니다.
· 프리킥 공격이 실패했을 때 상대 역습에 대응하기 위한 설정으로 볼 수 있습니다.
· 직접 프리킥 시에 상대 수비에 차단을 당하거나 먼 거리에서의 프리킥도 상대와의 경합에서 패배했을 때 상대에게 역습 기회를 제공해줄 수 있기 때문에 이러한 위험을 대비할 수 있습니다.

# 균형 잡힌 프리킥( 추천 수치 : 3 )
· 프리킥 시 공격자가 상대 페널티 박스 안에 적당히 배치됩니다.
· 상대 역습을 대응하면서도 공격에 참여하는 선수의 수도 어느 정도 유지하고 싶다면 도움이 될 수 있습니다.

# 공격적인 프리킥 ( 추천 수치 : 4~5 )
· 프리킥 시 공격자가 상대 페널티 박스 안에 많은 선수가 배치됩니다.
· 이는 프리킥 이후 세컨볼 상황에 우위를 확보할 수 있는 가능성이 높아집니다.
· 또한, 먼 거리 프리킥에서도 선수를 많이 배치함으로서 공중볼 경합을 유리하게 하거나 가까운 선수에게 먼저 패스한 뒤 페널티 박스 안의 선수들을 이용한 플레이도 가능합니다.
· 하지만 공격이 실패한 경우에는 공격에 참여한 선수들이 수비로 전환하는 속도가 느릴 수 있어서 상대 역습에 대응하기 어려울 수 있습니다.
""",
}

summarized_defend_chose_dict = {
    "후퇴": """
    모든 필드 선수가 수비 지역으로 내려와 수비 라인을 낮추어 상대 침투 플레이에 대응하고 수적 우위를 확보합니다. 하지만 중거리 슛에 취약하고 빠른 역습이 어렵습니다. '오프사이드 트랩'이나 '빠른 빌드업' 전술로 단점을 보완할 수 있습니다.
    
    # 상대 침투 플레이에 대한 대응
    · 수비 라인을 낮추어 GK와의 거리를 줄이고 뒷 공간을 좁혀 침투 플레이를 방어합니다.
    
    # 수비 상황에서의 수적 우위
    · 후퇴 전술로 수비 상황에서 수적 우위를 점하고 상대의 전진 패스와 패스 전개를 방해합니다.
    
    # 상대의 중거리 슛에 취약
    · 후퇴 전술은 중거리 슛에 취약하지만, '오프사이드 트랩'이나 '팀 압박'으로 이를 보완할 수 있습니다.
    """,
    "밸런스": """
    기본 수비 포메이션을 유지하며, 선수들이 수비와 공격을 자연스럽게 전환합니다. '밸런스' 전술은 상황에 따라 위치 조정을 하며, 빈틈 발생 시 즉시 수비로 복귀합니다.
    
    # 공격적인 전술을 원하는 경우
    · 선수들은 위치를 크게 벗어나지 않고, 간격을 유지하며 이동합니다.
    · 스태미너 부담이 적어 '빠른 빌드업' 등 공격적 전술과 잘 맞습니다.
    · 공격력과 수비력의 균형을 통해 균형잡힌 플레이 가능합니다.
    
    # 기본 수비 형태를 유지하는 경우
    · '밸런스'는 공수 균형에 효과적이나, 전술적 강점은 덜합니다.
    · 다른 압박 전술에 비해 리스크를 최소화하며, 상대 공격에 유연하게 대응합니다.
    · 기본 수비 균형 유지로 포메이션 유지 및 공격 전환 시 자연스러움을 제공합니다.
    """,
    "볼 터치 실수 시 압박": """
    밸런스 전술과 유사하게 상대의 불안정한 빌드업 시 주변 압박과 패스 차단을 시도합니다. 압박은 상대가 공격 방향을 등지고 있거나, 사이드 라인에서 빌드업하거나, 루즈볼 상황에서 발동되어 위험을 최소화하며, 스태미너 소모가 증가합니다.
    
    # 상대가 공격 방향을 등지고 있는 상황에서의 압박
    · 상대가 공격 방향을 등지면 5초간 4~5명이 압박해 패스 경로를 차단하고 가로채기 기회를 노립니다.
    # 사이드 라인 빌드업 시 압박
    · 사이드 라인에서의 빌드업 시 5초간 압박해 패스 선택을 제한하며, 하프라인 넘어서는 압박은 하지 않아 수비 라인 보호합니다.

    # 루즈볼 상황에서 압박
    · 루즈볼 시 5초간 압박해 공 소유권 경쟁을 유리하게 하며, 실패해도 수비에 유리한 상황을 만듭니다.
    """,
    "공 뺏긴 직후 압박": """
    공을 잃은 후 약 7초 동안 상대를 압박해 빠르게 공을 되찾는 '게겐 프레싱' 전술은 공격 기회를 높이고 상대의 실수를 유도합니다. 이 전술은 공격적 위치에서 공을 소유하게 하며, 실패 시 수비 공백이 생길 수 있고 선수의 스태미너 소모가 커집니다.
    
    # 게겐 프레싱 효과
    · 공을 잃은 직후 압박을 가해 공격권을 빠르게 되찾고, 상대 역습을 차단합니다.
    
    # 공격적인 위치에서 다시 득점 기회 획득 가능
    · 즉시 압박으로 공을 탈취하면 공격적 위치에서 플레이를 재개, 수비 라인의 빈 공간을 활용해 득점 기회를 높일 수 있습니다.
    
    # 압박 실패에 대한 대처
    · 상대의 긴 패스 탈압박 시, '공격 시 후방 대기' 전술과 공격 참여도 낮춤으로써 수비 빈 공간을 최소화하고 역습 대비합니다.
    """,
    "지속적인 압박": """
    수비 시 상대 빌드업을 방해하며 공을 되찾는 전술로, 공격수도 압박에 참여해 득점 기회를 만듭니다. 하지만 선수 스태미너 소모가 큰 단점이 있으며, 이는 상황에 따라 전술 사용을 조절함으로써 완화할 수 있습니다. 압박 시 스태미너 소모가 증가합니다.
    
    # 지속적인 압박을 통한 공격 전략
    · 전방 압박으로 득점 기회 지역에서 공을 확보할 수 있으며, 빠른 빌드업과 결합 시 효과적입니다. 단, 스태미너 관리가 중요합니다.
    
    # 상대 역습 및 패스 전개에 대처
    · '지속적인 압박'은 공격적 수비 전술이나 모든 상황에 적합하지 않습니다. 상대의 역습이나 패스 전개에 취약할 수 있으므로, 상황에 따라 수비 전술을 조정하는 것이 유리합니다. 필요 시 '볼 터치 실수 시 압박'이나 '팀 압박' 전술로 전환하여 상대의 공격을 차단할 수 있습니다.
    """,
}

summarized_offend_chose_dict = {
    "느린 빌드업": """
    공격 중심의 점유형 플레이를 위한 전술로, 공 소유를 중심으로 한 패스 움직임을 강조합니다. 빠른 공격 대신 짧은 패스로 안정적인 공격을 추구하며, 공 소유권을 유지해 상대 역습을 줄입니다.
    
    # 높은 공 점유율을 유지할 수 있는 효과
    · 서포트 움직임이 많아 패스 옵션이 증가하고, 짧은 패스로 공 점유 시간을 늘려 상대 공격 기회를 줄입니다. 천천히 공격을 전개하고자 할 때 유리합니다.
    
    # 짧은 패스 플레이를 이용한 공격 루트
    · 짧은 패스로 상대 압박을 유도하고 반대 측면 공간을 활용해 공격 기회를 창출합니다. 상대 집중을 이용한 공간 창출이 득점으로 이어질 수 있습니다.
    
    # 상대 수비를 공략하기 힘든 경우
    · 미드필더의 제한된 공격 참여로 수적 우위를 얻기 어렵고, 상대 수비 형태 유지 시 득점 기회 창출이 어려워집니다. 이때는 전술 변화를 고려해야 하며, '빠른 빌드업'이나 '밸런스' 전략으로 전환하는 것이 좋습니다.
    """,
    "밸런스": """
    밸런스 전술은 공격과 수비의 균형을 유지하는 스타일로, 상대 전술에 유연하게 대응할 수 있습니다. 선수들은 상황에 맞게 위치를 변경하며, 특정 플레이에 치우치지 않아 다양한 스타일을 구현할 수 있습니다.
    
    # 안정적인 공격 플레이
    · '밸런스'는 공격과 수비 사이 균형을 통해 역습에 취약한 부분을 줄입니다.
    · 이 전술은 안정적인 공격과 수비적 고려를 동시에 원하는 경우 적합합니다.
    
    # 다양한 공격 루트 활용
    · '밸런스'는 특정 강점 없이 기본 움직임으로 공격을 전개하며 다양한 공격 루트를 제공합니다.
    · 이를 통해 상대 수비의 약점을 파악하고 다른 전술로 전환해 혼란을 줄 수 있습니다.""",
    "긴 패스": """
    '긴 패스' 전술은 상대 수비 라인 뒤 공간을 활용해 위협적인 패스를 하는 전략입니다. 상대 수비가 높거나 공격적일 때 특히 유리하며, 깊은 침투를 원하는 팀에 적합합니다.
    
    # 상대 수비 라인의 위치가 높은 경우
    · 높은 수비 라인 상대에게 '긴 패스'가 유리합니다.
    · 공격수는 오프사이드 라인 근처로 이동해 뒷공간 침투를 시도합니다.
    · 스루 패스나 로빙 스루 패스로 득점 기회를 창출합니다.
    · 속도가 빠른 선수를 전방에 배치하는 것이 중요합니다.
    
    # 빠른 공격 전환과 카운터에 유리
    · 공격적인 상대에게 공을 빼앗으면 '긴 패스'로 바로 전방 공격수에게 연결할 수 있어 유리합니다.
    
    # 상대가 수비 라인을 내리는 경우
    · 상대 수비가 내려서면 '긴 패스'의 효과가 줄어들며, 공격 전술 변경을 고려해야 합니다.
    
    # 공중볼 경합에 밀리는 경우
    · '긴 패스'는 공중볼 경합을 유발하고 정확성이 낮을 수 있습니다.
    · 반복되면 예측되어 공격 기회 창출이 어려워지므로, 빌드업을 통한 공격 루트 창출로 전략을 변경하는 것이 좋습니다.""",
    "빠른 빌드업": """
    '빠른 빌드업'은 공격 속도를 높여 상대 수비를 뚫는 전술로, 수비를 제외한 선수들이 전방으로 적극적으로 이동해 수적 우위를 점하며 공격 기회를 창출합니다. 하지만, 선수들의 스태미너 소모가 크므로 경기 상황에 따라 조절이 필요합니다.
    
    # 빠른 공격 플레이의 주요 효과
    · 선수들이 빠르게 전진하며 상대 수비의 허점을 이용할 수 있고, 상대의 실수로 공을 빼앗았을 때 신속한 역습으로 득점 기회를 얻을 수 있습니다.
    
    # 공격 지역에서 수적 우위 효과
    · 대부분의 선수가 공격에 참여해 상대보다 수적 우위를 확보하고, 이를 통해 다양한 공격 옵션을 생성할 수 있습니다.
    
    # 수비적 취약성에 대한 대처
    · 전방으로 집중된 선수들로 인해 역습에 취약해질 수 있으므로, 사이드 풀백이나 중앙 미드필더에게 수비적 위치를 유지하도록 지시하여 역습 위험을 줄일 수 있습니다.
    
    # 스태미너 소모에 대한 대처
    · 전술로 인한 높은 스태미너 소모는 경기 후반에 선수 교체를 통해 해결할 수 있으며, 새로운 선수는 공격에 활력을 더해줄 수 있습니다.""",
}

summarized_defend_score_dict = {
    "폭": """
    수비 상황에서 수비 라인의 넓이를 조절하는 것은 중요합니다. 이는 수비 선수들이 수비 라인을 좁게 혹은 넓게 형성하게 하며, 뉴택틱 업데이트 이후 최소, 최대 범위가 넓어져 수치에 따른 변별력이 커졌습니다. 상대의 플레이 스타일에 따라 폭을 조절하여 측면 수비를 강화하거나 중앙을 단단히 할 수 있습니다.

    # 중앙 지역으로 좁게 유지 ( 추천 수치 : 1~3 )
    · 중앙 지역을 강화하여 중앙으로의 패스와 침투 패스 공간을 차단합니다.
    · 중앙이 강화되면 측면 공간이 넓어져 측면 공격에 취약할 수 있으나, 제공권이 좋은 중앙 수비 배치로 대응할 수 있습니다.

    # 적절한 수비 간격 유지 ( 추천 수치 : 4~7 )
    · 균형 잡힌 수비 폭으로 다양한 공격 상황에 효과적으로 대응할 수 있습니다.
    · 중앙과 측면 공격을 혼합하는 상대에게 유용합니다.

    # 측면으로 넓게 유지 ( 추천 수치 : 8~10 )
    · 수비 폭을 넓게 하여 측면 수비를 강화하고 크로스 및 컷백 플레이에 대응합니다.
    · 넓은 수비 간격은 중앙 지역에 침투 공간을 만들어 주의가 필요합니다.
    """,
    "깊이": """
    수비 라인의 깊이를 조절해 수비 전략을 결정합니다. 깊이에 따라 수비 라인을 깊게 혹은 높게 설정하며, 압박 전술이나 지역 수비 전술과 결합해 효과를 극대화할 수 있습니다.

    # 깊은 수비 라인 (추천 수치: 1~3)
    · 진영 가까이 수비 라인을 배치해 빠른 공격을 방어합니다.
    · 압박이 어렵고 중거리 슛이나 패스 플레이에 취약합니다.

    # 보통 (추천 수치: 4~7)
    · 균형 잡힌 수비 라인으로 압박과 뒷 공간 방어가 가능합니다.
    · 다양한 공격 패턴에 유연하게 대응할 수 있습니다.

    # 높은 수비 라인 (추천 수치: 8~10)
    · 상대 진영 가까이 수비 라인을 배치해 압박 범위를 좁힙니다.
    · 짧은 패스에 효과적이나, 뒷 공간 침투에 취약합니다.
    · 상대 공격 패턴에 따라 수비 라인 조절이 필요합니다.
    """,
}

summarized_offend_score_dict = {
    "폭": """
    공격 시 선수의 폭을 결정하는 설정으로, 1부터 10까지 조절 가능하며, 높은 수치는 경기장을 넓게 사용합니다. 상대 수비 간격에 따라 폭을 조절해 공격 전략을 세웁니다.

    # 짧은 패스 플레이 (추천 수치: 1~3)
    · 중앙을 통한 짧은 패스 플레이에 적합하며, 선수 간격이 좁습니다.
    · 중앙 집중 공격이지만, 상대 중앙 압박 시 측면 수비 취약성이 생깁니다.

    # 간격 균형 유지 (추천 수치: 4~7)
    · 공격과 수비 사이 균형을 유지하며, 중앙과 측면 공격을 모두 활용합니다.
    · 균형 있는 공격을 원한다면 4~7 수치가 적절합니다.

    # 넓은 공간 활용 (추천 수치: 8~10)
    · 측면 공간을 최대한 활용해 공격합니다.
    · 사이드 플레이에 유리하지만, 중앙 공간이 빈틈이 생겨 역습에 취약합니다.
    """,
    "박스 안 쪽 선수": """
    크로스 상황에서 상대 페널티 박스 안 선수 수를 1부터 10까지 조절해 다양한 플레이를 결정합니다.

    # 수비적인 크로스 플레이 ( 추천 수치 :1~3 )
    · 수비적 플레이에 적합하며, 적은 선수 배치로 중거리 슛이 유리합니다.
    · 역습 대응에 효과적입니다.

    # 균형적인 크로스 플레이 ( 추천 수치 : 4~7 )
    · 공격과 수비의 균형을 맞추며, 적절한 선수 배치로 크로스 공격이 가능합니다.

    # 공격적인 크로스 플레이 ( 추천 수치 8~10 )
    · 크로스 득점에 유리하며, 페널티 박스 내 선수 집중으로 헤더나 세컨볼 확보가 용이합니다.
    · 역습에 취약할 수 있습니다.
    """,
    "코너킥": """
    코너킥은 득점 기회를 제공하는 중요한 세트플레이로, 선수 배치와 패턴을 다양하게 조정할 수 있습니다.

    # 수비적인 코너킥 ( 추천 수치 : 1~2 )
    · 상대 페널티 박스 안 선수가 적어 득점 기회는 줄지만, 역습 대비에 유리합니다.
    · 공중볼에 약하거나 공격 필요성이 낮을 때 적은 인원 배치가 좋습니다.

    # 균형 잡힌 코너킥 ( 추천 수치 : 3 )
    · 적당한 선수 배치로 공격과 수비 균형을 맞춥니다.
    · 득점과 역습 방어 사이 균형 있는 선택입니다.

    # 공격적인 코너킥 ( 추천 수치 : 4~5 )
    · 페널티 박스 안에 많은 선수 배치로 득점 기회 증가합니다.
    · 공중볼에 강한 선수가 많을수록 유리하지만, 역습 대응에 취약할 수 있습니다.
    """,
    "프리킥": """
    프리킥은 축구에서 득점 기회를 만들거나 동료에게 기회를 제공하는 중요한 전략입니다. 이제 프리킥 설정을 조정해 다양한 세트피스 기회를 창출할 수 있습니다.

    # 수비적인 프리킥 (추천 수치: 1~2)
    · 상대 페널티 박스 안에 공격자를 적게 배치해 역습에 대비합니다.
    · 직접 프리킥 실패 시 역습 위험을 줄일 수 있습니다.

    # 균형 잡힌 프리킥(추천 수치: 3)
    · 적당한 수의 공격자를 페널티 박스 안에 배치해 역습 대응과 공격 참여를 균형 있게 합니다.

    # 공격적인 프리킥 (추천 수치: 4~5)
    · 많은 선수를 페널티 박스 안에 배치해 세컨볼 상황에서 우위를 확보합니다.
    · 공격 실패 시 수비 전환 속도가 느려 역습에 취약할 수 있습니다.
    """,
}
